# ==============================================================================
# Taps
# ==============================================================================
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/boneyard'
tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'elastic/tap'

# ==============================================================================
# Cask setups
# ==============================================================================
tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'caskroom/versions'
cask_args appdir: '/Applications'

# ==============================================================================
# Utilities
# ==============================================================================
brew 'coreutils' # Basic file, shell and text manipulation utilities (GNU)
brew 'tree' # Display directories as trees
brew 'unrar' # unarchiving tools supporting multiple formats

# ==============================================================================
# DEV DEPENDENCIES
# ==============================================================================
brew 'imagemagick' # image manipulation tools (rails req)
brew 'wget'
brew 'pv' # monitor data through |
brew 'z' # makes cd smarter by most used directories
brew 'fzf' # command line fuzzy finder
brew 'bat' # better than cat
brew 'git'

# GUN Library Tools / Dev Dependencies usually
brew 'bison'
brew 'automake' # generating GNU Standards-compliant Makefiles
brew 'glib' # general-purpose, portable utility library for making apps
brew 'p11-kit' # dependency (something requires it but idk exactly what)
brew 'libtool'
brew 'guile'
brew 'libheif'
brew 'libffi'
brew 'openssl@1.1'
brew 'htop'
brew 'shared-mime-info'
brew 'libssh2'
brew 'libyaml'
brew 'gmp'
brew 'gpg' # required for asdf/node plugin
brew 'ruby-build'
brew 'asdf' # ruby/node/etc version manager

# other tools that from old machine
brew 'emacs'
brew 'fd' # alternative to find
brew 'gh' # github
brew 'git' # git
brew 'netcat'
brew 'nghttp2'
brew 'procs' # ps upgrade written rust
brew 'iproute2mac' # ip command wrappers
brew 'openslide'
brew 'redis'
brew 'ripgrep' # better grep

# ==============================================================================
# Docker
# ==============================================================================
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
cask 'docker'

# ==============================================================================
# Terminal Stuff
# ==============================================================================
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'zsh-syntax-highlighting'
brew 'tmux'
brew 'tmuxinator' # may not need if I install gem but not sure yet.
cask 'iterm2'
cask 'alacritty'

# ==============================================================================
# IDE || VSCODE
# ==============================================================================
# APP
cask 'visual-studio-code'
## EXTENSIONS
vscode 'aki77.rubocop-quick-fix'
vscode 'alefragnani.project-manager'
vscode 'amih90.to'
vscode 'angular.ng-template'
vscode 'arcticicestudio.nord-visual-studio-code'
vscode 'azemoh.one-monokai'
vscode 'castwide.solargraph'
vscode 'codezombiech.gitignore'
vscode 'connorshea.vscode-ruby-test-adapter'
vscode 'creinbacher.xpathtester'
vscode 'darkriszty.markdown-table-prettify'
vscode 'dbaeumer.vscode-eslint'
vscode 'donjayamanne.git-extension-pack'
vscode 'donjayamanne.githistory'
vscode 'dracula-theme.theme-dracula'
vscode 'eamodio.gitlens'
vscode 'editorconfig.editorconfig'
vscode 'eliverlara.andromeda'
vscode 'esbenp.prettier-vscode'
vscode 'fabianlauer.vs-code-xml-format'
vscode 'fabiospampinato.vscode-diff'
vscode 'fabiospampinato.vscode-open-in-github'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'gookyn.case-helper'
vscode 'groksrc.ruby'
vscode 'hbenl.vscode-test-explorer'
vscode 'hoovercj.ruby-linter'
vscode 'hridoy.rails-snippets'
vscode 'huizhou.githd'
vscode 'kaiwood.endwise'
vscode 'kiteco.kite'
vscode 'lorankloeze.ruby-rubocop-revived'
vscode 'mechatroner.rainbow-csv'
vscode 'medo64.render-crlf'
vscode 'miguel-savignano.ruby-symbols'
vscode 'mintlify.document'
vscode 'misogi.ruby-rubocop'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode.live-server'
vscode 'ms-vscode.test-adapter-converter'
vscode 'ms-vscode.vscode-typescript-next'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'orta.vscode-jest'
vscode 'quoyi.rails-vscode'
vscode 'redhat.vscode-xml'
vscode 'redhat.vscode-yaml'
vscode 'rokoroku.vscode-theme-darcula'
vscode 'romanpeshkov.vscode-text-tables'
vscode 'rubocop.vscode-rubocop'
vscode 'ryanlaws.toggle-case'
vscode 'ryanluker.vscode-coverage-gutters'
vscode 'samuelcharpentier.remove-non-ascii-chars'
vscode 'sdras.night-owl'
vscode 'searking.preview-vscode'
vscode 'shardulm94.trailing-spaces'
vscode 'shd101wyy.markdown-preview-enhanced'
vscode 'shopify.ruby-lsp'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'stylelint.vscode-stylelint'
vscode 'tabnine.tabnine-vscode'
vscode 'thegeoffstevens.best-dark-themes-pack'
vscode 'vayan.haml'
vscode 'vense.rails-snippets'
vscode 'vortizhe.simple-ruby-erb'
vscode 'vs-publisher-1448185.keyoti-changeallendoflinesequence'
vscode 'vscodevim.vim'
vscode 'waderyan.gitblame'
vscode 'walkme.ruby-extension-pack'
vscode 'wesbos.theme-cobalt2'
vscode 'whizkydee.material-palenight-theme'
vscode 'wingrunr21.vscode-ruby'
vscode 'youssef.viow'
vscode 'zhuangtongfa.material-theme'
vscode 'ziyasal.vscode-open-in-github'

# ==============================================================================
# BROWSERS
# ==============================================================================
cask 'brave-browser'
cask 'brave-browser-nightly'
cask 'firefox'
cask 'google-chrome'

# ==============================================================================
# Meetings
# ==============================================================================
cask 'zoom'

# ==============================================================================
# My personal sanity
# ==============================================================================
cask 'slack'
cask 'spotify'

# ==============================================================================
# Productivity Apps
# ==============================================================================
cask 'libreoffice'
cask '1password'
cask 'appcleaner'
cask 'bartender'
cask 'cleanshot' # screencapture and recording
cask 'clipy' # clipboard extender
cask 'caffeine' # keeps macbook awake when running scripts and inactive while
                # viewing the command-line
cask 'postgres-unofficial' # postgres tool for mac better than cli
cask 'istat-menus' # rss monitoring

# ==============================================================================
# Apple App Store
# ==============================================================================
brew 'mas' # app store client
mas 'Xcode', id: 497799835

# ==============================================================================
# Fonts
# ==============================================================================
tap 'caskroom/fonts'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack-nerd-font'
cask 'font-anonymous-pro'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans'
cask 'font-droid-sans-mono font-droid-sans-mono-for-powerline'
cask 'font-meslo-lg font-input'
cask 'font-inconsolata font-inconsolata-for-powerline'
cask 'font-liberation-mono font-liberation-mono-for-powerline'
cask 'font-liberation-sans'
cask 'font-meslo-lg'
cask 'font-nixie-one'
cask 'font-office-code-pro'
cask 'font-pt-mono'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-ubuntu font-ubuntu-mono-powerline'
cask 'font-consolas-for-powerline'
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-devicons'
cask 'font-fontawesome'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-roboto'