# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/boneyard'
tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Tap caskroom
tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'caskroom/versions'

# Brew Dependencies 
brew 'coreutils'
brew 'ruby-build'
brew 'source-highlight'
brew 'tig'
brew 'tree'
brew 'unrar'

# Other Dependencies 
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'watch'
brew 'wget'
brew 'pv'
brew 'z'
brew 'fzf'
brew 'jq'
brew 'cowsay'

# Programming languages
brew 'elm'
brew 'erlang'
brew 'elixir'
brew 'python'
brew 'python3'

# Docker 
brew 'docker' 
brew 'docker-compose'
brew 'docker-machine'

# BASH
brew 'bash'
brew 'bash-completion'
brew 'bashish'

# ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'zsh-syntax-highlighting'

# CASKS 
cask_args appdir: '/Applications'
tap 'homebrew/bundle'

# Web Browsers
cask 'firefox'
cask 'google-chrome'
brew 'lynx'
cask 'opera'

# Development Tools
brew 'git'
cask "virtualbox"
cask 'iterm2'
cask 'vlc'

# Apps
cask 'slack'
cask 'spotify'

# Programming IDES
cask 'atom'
cask 'visual-studio-code'

# Fonts 
brew 'fontconfig'
brew 'freetype'
brew 'lcdf-typetools'

tap 'caskroom/fonts'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack-nerd-font'
cask 'font-anonymous-pro'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans'
cask 'font-droid-sans-mono font-droid-sans-mono-for-powerline'
cask 'font-meslo-lg font-input'
cask 'font-inconsolata font-inconsolata-for-powerline'
cask 'font-liberation-mono font-liberation-mono-for-powerline'
cask 'font-liberation-sans'
cask 'font-meslo-lg'
cask 'font-nixie-one'
cask 'font-office-code-pro'
cask 'font-pt-mono'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-ubuntu font-ubuntu-mono-powerline'
cask 'font-consolas-for-powerline'
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-devicons'
cask 'font-fontawesome'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-roboto'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
